sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.c
/*!
    \file    gd32a7xx_spi.c
    \brief   SPI driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_spi.h"

/* SPI/I2S parameter initialization mask */
#define SPI_INIT_MASK                   ((uint32_t)0x00003040U)
#define I2S_INIT_MASK                   ((uint32_t)0x0000F047U)
#define I2S_FULL_DUPLEX_MASK            ((uint32_t)0x0000F040U)

#define SPI_RXLVL_MASK                  ((uint32_t)0x00001E00U)
#define SPI_TXLVL_MASK                  ((uint32_t)0x0003C000U)
#define SPI_DZ_INIT_MASK                ((uint32_t)0xFFFFE0FFU)

/* default value */
#define SPI_I2SPSC_RESET                ((uint32_t)0x00000002U)  /*!< default value of SPI_I2SPSC register */

/*!
    \brief      reset SPI and I2S (API_ID: 0x0001U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_i2s_deinit(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif
    {
        /* reset SPI register */
        SPI_CTL0(spi_periph)    = 0x00000000U;
        SPI_CTL1(spi_periph)    = 0x01000700U;
        SPI_STAT(spi_periph)    = 0x00000002U;
        SPI_DATA(spi_periph)    = 0x00000000U;
        SPI_CRCPOLY(spi_periph) = 0x00000107U;
        SPI_I2SCTL(spi_periph)  = 0x00000000U;
        SPI_I2SPSC(spi_periph)  = 0x00000002U;
        SPI_MREQCFG(spi_periph) = 0x00000000U;
        SPI_CKCFG0(spi_periph)  = 0x00000000U;
        SPI_CKCFG1(spi_periph)  = 0x00001003U;
        SPI_CCTL(spi_periph)    = 0x00000000U;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        SPI_POLCTL(spi_periph)  = 0x00000000U;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        SPI_QCTL(spi_periph)    = 0x00000000U;
        switch(spi_periph) {
        case SPI0:
            /* reset SPI0 */
            rcu_periph_reset_enable(RCU_SPI0RST);
            rcu_periph_reset_disable(RCU_SPI0RST);
            break;
        case SPI1:
            /* reset SPI1 */
            rcu_periph_reset_enable(RCU_SPI1RST);
            rcu_periph_reset_disable(RCU_SPI1RST);
            break;
        case SPI2:
            /* reset SPI2 */
            rcu_periph_reset_enable(RCU_SPI2RST);
            rcu_periph_reset_disable(RCU_SPI2RST);
            break;
        case SPI3:
            /* reset SPI3 */
            rcu_periph_reset_enable(RCU_SPI3RST);
            rcu_periph_reset_disable(RCU_SPI3RST);
            break;
        case SPI4:
            /* reset SPI4 */
            rcu_periph_reset_enable(RCU_SPI4RST);
            rcu_periph_reset_disable(RCU_SPI4RST);
            break;
        case SPI5:
            /* reset SPI5 */
            rcu_periph_reset_enable(RCU_SPI5RST);
            rcu_periph_reset_disable(RCU_SPI5RST);
            break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case SPI6:
            /* reset SPI6 */
            rcu_periph_reset_enable(RCU_SPI6RST);
            rcu_periph_reset_disable(RCU_SPI6RST);
            break;
        case SPI7:
            /* reset SPI7 */
            rcu_periph_reset_enable(RCU_SPI7RST);
            rcu_periph_reset_disable(RCU_SPI7RST);
            break;
#endif /* GD32A72XX or GD32A74XX */
        default :
            break;
        }
    }
}

/*!
    \brief      initialize the parameters of SPI structure with the default values (API_ID: 0x0002U)
    \param[in]  none
    \param[out] spi_struct: the initialized structure spi_parameter_struct pointer
    \retval     none
*/
void spi_struct_para_init(spi_parameter_struct *spi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(spi_struct)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* configure the SPI structure with the default values */
        spi_struct->device_mode          = SPI_SLAVE;
        spi_struct->trans_mode           = SPI_TRANSMODE_FULLDUPLEX;
        spi_struct->nss                  = SPI_NSS_HARD;
        spi_struct->nss_polarity         = SPI_NSS_POLARITY_LOW;
        spi_struct->clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
        spi_struct->prescale             = SPI_PSC_2;
        spi_struct->endian               = SPI_ENDIAN_MSB;
    }
}

/*!
    \brief      initialize SPI parameter (API_ID: 0x0003U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  spi_struct: SPI parameter initialization stuct members of the structure
                            and the member values are shown as below:
                  device_mode: SPI_MASTER, SPI_SLAVE
                  trans_mode: SPI_TRANSMODE_FULLDUPLEX, SPI_TRANSMODE_RECEIVEONLY,
                              SPI_TRANSMODE_BDRECEIVE, SPI_TRANSMODE_BDTRANSMIT
                  nss: SPI_NSS_SOFT, SPI_NSS_HARD
                  nss_polarity: SPI_NSS_POLARITY_LOW, SPI_NSS_POLARITY_HIGH
                  endian: SPI_ENDIAN_MSB, SPI_ENDIAN_LSB
                  clock_polarity_phase: SPI_CK_PL_LOW_PH_1EDGE, SPI_CK_PL_HIGH_PH_1EDGE
                                        SPI_CK_PL_LOW_PH_2EDGE, SPI_CK_PL_HIGH_PH_2EDGE
                  prescale: SPI_PSC_n (n=2,4,6,8,10,12,14,...256)
    \param[out] none
    \retval     none
*/
void spi_init(uint32_t spi_periph, spi_parameter_struct *spi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(spi_struct)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else if(NOT_SPI_DEVICE_MODE(spi_struct->device_mode)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_TRANS_MODE(spi_struct->trans_mode)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_NSS(spi_struct->nss)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_NSS_POLARITY(spi_struct->nss_polarity)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_ENDIAN(spi_struct->endian)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_CLOCK_POLARITY_PHASE(spi_struct->clock_polarity_phase)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_PRESCALE(spi_struct->prescale)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg0, reg1;
        reg0 = SPI_CTL0(spi_periph);
        reg1 = SPI_CTL1(spi_periph);
        reg0 &= SPI_INIT_MASK;
        reg1 &= (~SPI_CTL1_NSSPOL);

