sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.c
        /* select SPI as master or slave */
        reg0 |= spi_struct->device_mode;
        /* select SPI transfer mode */
        reg0 |= spi_struct->trans_mode;
        /* select SPI NSS use hardware or software */
        reg0 |= spi_struct->nss;
        /* select SPI LSB or MSB */
        reg0 |= spi_struct->endian;
        /* select SPI polarity and phase */
        reg0 |= spi_struct->clock_polarity_phase;
        /* select SPI prescale to adjust transmit speed */
        reg0 |= ((spi_struct->prescale) << 16U);
        /* select NSS polarity as high or low */
        reg1 |= spi_struct->nss_polarity;

        /* prevent master software NSS mode configuration errors */
        if(SPI_MASTER == spi_struct->device_mode && SPI_NSS_POLARITY_HIGH == spi_struct->nss_polarity) {
            reg0 &= (~SPI_CTL0_SWNSS);
        }

        /* write to SPI_CTL0 register */
        SPI_CTL0(spi_periph) = (uint32_t)reg0;
        /* write to SPI_CTL1 register */
        SPI_CTL1(spi_periph) = (uint32_t)reg1;
    }
}

/*!
    \brief      enable SPI (API_ID: 0x0004U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_SPIEN;
    }
}

/*!
    \brief      disable SPI (API_ID: 0x0005U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_SPIEN);
    }
}

/*!
    \brief      initialize I2S parameter (API_ID: 0x0006U)
    \param[in]  i2s_periph: I2Sx(x=4,5,6,7)
    \param[in]  i2s_mode: I2S operation mode
                only one parameter can be selected which is shown as below:
      \arg        I2S_MODE_SLAVETX: I2S slave transmit mode
      \arg        I2S_MODE_SLAVERX: I2S slave receive mode
      \arg        I2S_MODE_MASTERTX: I2S master transmit mode
      \arg        I2S_MODE_MASTERRX: I2S master receive mode
    \param[in]  i2s_standard: I2S standard
                only one parameter can be selected which is shown as below:
      \arg        I2S_STD_PHILIPS: I2S phillips standard
      \arg        I2S_STD_MSB: I2S MSB standard
      \arg        I2S_STD_LSB: I2S LSB standard
      \arg        I2S_STD_PCMSHORT: I2S PCM short standard
      \arg        I2S_STD_PCMLONG: I2S PCM long standard
    \param[in]  i2s_ckpl: I2S idle state clock polarity
                only one parameter can be selected which is shown as below:
      \arg        I2S_CKPL_LOW: I2S clock polarity low level
      \arg        I2S_CKPL_HIGH: I2S clock polarity high level
    \param[out] none
    \retval     none
*/
void i2s_init(uint32_t i2s_periph, uint32_t i2s_mode, uint32_t i2s_standard, uint32_t i2s_ckpl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_I2S_PERIPH(i2s_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else if(NOT_SPI_I2S_MODE(i2s_mode)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_I2S_STANDARD(i2s_standard)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_I2S_CKPL(i2s_ckpl)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;
        reg = SPI_I2SCTL(i2s_periph);
        reg &= I2S_INIT_MASK;

        /* enable I2S mode */
        reg |= (uint32_t)SPI_I2SCTL_I2SSEL;
        /* select I2S mode */
        reg |= (uint32_t)i2s_mode;
        /* select I2S standard */
        reg |= (uint32_t)i2s_standard;
        /* select I2S polarity */
        reg |= (uint32_t)i2s_ckpl;

        /* write to SPI_I2SCTL register */
        SPI_I2SCTL(i2s_periph) = (uint32_t)reg;
    }
}

/*!
    \brief      configure I2S prescaler (API_ID: 0x0007U)
    \param[in]  i2s_periph: I2Sx(x=4,5,6,7)
    \param[in]  i2s_audiosample: I2S audio sample rate
                only one parameter can be selected which is shown as below:
      \arg        I2S_AUDIOSAMPLE_8K: audio sample rate is 8KHz
      \arg        I2S_AUDIOSAMPLE_11K: audio sample rate is 11KHz
      \arg        I2S_AUDIOSAMPLE_16K: audio sample rate is 16KHz
      \arg        I2S_AUDIOSAMPLE_22K: audio sample rate is 22KHz
      \arg        I2S_AUDIOSAMPLE_32K: audio sample rate is 32KHz
      \arg        I2S_AUDIOSAMPLE_44K: audio sample rate is 44KHz
      \arg        I2S_AUDIOSAMPLE_48K: audio sample rate is 48KHz
      \arg        I2S_AUDIOSAMPLE_96K: audio sample rate is 96KHz
      \arg        I2S_AUDIOSAMPLE_192K: audio sample rate is 192KHz
    \param[in]  i2s_frameformat: I2S data length and channel length
                only one parameter can be selected which is shown as below:
      \arg        I2S_FRAMEFORMAT_DT16B_CH16B: I2S data length is 16 bit and channel length is 16 bit
      \arg        I2S_FRAMEFORMAT_DT16B_CH32B: I2S data length is 16 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT24B_CH32B: I2S data length is 24 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT32B_CH32B: I2S data length is 32 bit and channel length is 32 bit
    \param[in]  i2s_mckout: I2S master clock output
                only one parameter can be selected which is shown as below:
      \arg        I2S_MCKOUT_ENABLE: I2S master clock output enable
      \arg        I2S_MCKOUT_DISABLE: I2S master clock output disable
    \param[out] none
    \retval     none
*/
void i2s_psc_config(uint32_t i2s_periph, uint32_t i2s_audiosample, uint32_t i2s_frameformat,
                    uint32_t i2s_mckout)
{
    uint32_t i2sdiv, i2sof, clks, i2sclock;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_I2S_PERIPH(i2s_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else if(NOT_SPI_I2S_AUDIOSAMPLE(i2s_audiosample)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_I2S_FRAMEFORMAT(i2s_frameformat)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else if(NOT_SPI_I2S_MCKOUT(i2s_mckout)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* deinitialize SPI_I2SPSC register */
        SPI_I2SPSC(i2s_periph) = SPI_I2SPSC_RESET;
        /* get system clock */
        i2sclock = rcu_clock_freq_get(CK_SYS);
        /* configure the prescaler depending on the mclk output state, the frame format and audio sample rate */
        if(I2S_MCKOUT_ENABLE == i2s_mckout) {
            clks = (uint32_t)(((i2sclock / 256U) * 10U) / i2s_audiosample);
        } else {
            if(I2S_FRAMEFORMAT_DT16B_CH16B == i2s_frameformat) {
                clks = (uint32_t)(((i2sclock / 32U) * 10U) / i2s_audiosample);
            } else {
                clks = (uint32_t)(((i2sclock / 64U) * 10U) / i2s_audiosample);
            }
        }

        /* remove the floating point */
        clks   = (clks + 5U) / 10U;
        i2sof  = (clks & 0x00000001U);
        i2sdiv = ((clks - i2sof) / 2U);
        i2sof  = (i2sof << 8U);

        /* set the default values */
        if((i2sdiv < 2U) || (i2sdiv > 255U)) {
            i2sdiv = 2U;
            i2sof = 0U;
        }

        /* configure SPI_I2SPSC */
        SPI_I2SPSC(i2s_periph) = (uint32_t)(i2sdiv | i2sof | i2s_mckout);

