sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.c
        /* clear SPI_I2SCTL_DTLEN and SPI_I2SCTL_CHLEN bits */
        SPI_I2SCTL(i2s_periph) &= (uint32_t)(~(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));

        /* configure data frame format */
        SPI_I2SCTL(i2s_periph) |= (uint32_t)i2s_frameformat;
    }
}

/*!
    \brief      enable I2S (API_ID: 0x0008U)
    \param[in]  i2s_periph: I2Sx(x=4,5,6,7)
    \param[out] none
    \retval     none
*/
void i2s_enable(uint32_t i2s_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_I2S_PERIPH(i2s_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else
#endif
    {
        SPI_I2SCTL(i2s_periph) |= (uint32_t)SPI_I2SCTL_I2SEN;
    }
}

/*!
    \brief      disable I2S (API_ID: 0x0009U)
    \param[in]  i2s_periph: I2Sx(x=4,5,6,7)
    \param[out] none
    \retval     none
*/
void i2s_disable(uint32_t i2s_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_I2S_PERIPH(i2s_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else
#endif
    {
        SPI_I2SCTL(i2s_periph) &= (uint32_t)(~SPI_I2SCTL_I2SEN);
    }
}

/*!
    \brief      enable SPI NSS output (API_ID: 0x000AU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_output_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_NSSDRV;
    }
}

/*!
    \brief      disable SPI NSS output (API_ID: 0x000BU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_output_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_NSSDRV);
    }
}

/*!
    \brief      SPI NSS pin high level in software mode (API_ID: 0x000CU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_internal_high(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_SWNSS;
    }
}

/*!
    \brief      SPI NSS pin low level in software mode (API_ID: 0x000DU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_internal_low(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_SWNSS);
    }
}


/*!
    \brief      SPI NSS select (API_ID: 0x000EU)
    \param[in]  spi_periph: SPIx(x=0...7)
                spi_nss_id: SPI_NSS_SELECT_x (x = 0~7)
    \param[out] none
    \retval     none
*/
void spi_nss_select(uint32_t spi_periph, uint32_t spi_nss_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else if(NOT_SPI_NSS_ID(spi_nss_id)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= (uint32_t)(spi_nss_id);
    }
}

/*!
    \brief      enable SPI DMA send or receive (API_ID: 0x000FU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  spi_dma: SPI DMA mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_DMA_TRANSMIT: SPI transmit data using DMA
      \arg        SPI_DMA_RECEIVE: SPI receive data using DMA
    \param[out] none
    \retval     none
*/
void spi_dma_enable(uint32_t spi_periph, uint8_t spi_dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else if(NOT_SPI_DMA_MODE(spi_dma)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_DMA_TRANSMIT == spi_dma) {
            SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_DMATEN;
        } else {
            SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_DMAREN;
        }
    }
}

/*!
    \brief      disable SPI DMA send or receive (API_ID: 0x0010U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  spi_dma: SPI DMA mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_DMA_TRANSMIT: SPI transmit data using DMA
      \arg        SPI_DMA_RECEIVE: SPI receive data using DMA
    \param[out] none
    \retval     none
*/
void spi_dma_disable(uint32_t spi_periph, uint8_t spi_dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else if(NOT_SPI_DMA_MODE(spi_dma)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_DMA_TRANSMIT == spi_dma) {
            SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_DMATEN);
        } else {
            SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_DMAREN);
        }
    }
}

/*!
    \brief      SPI transmit data (API_ID: 0x0011U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  data: 32-bit data
    \param[out] none
    \retval     none
*/
void spi_i2s_data_transmit(uint32_t spi_periph, uint32_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else
#endif
    {
        SPI_DATA(spi_periph) = (uint32_t)data;
    }
}

/*!
    \brief      SPI receive data (API_ID: 0x0012U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     32-bit data
*/
uint32_t spi_i2s_data_receive(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)SPI_DATA(spi_periph));
    }
    return reval;
}

/*!
    \brief      configure SPI bidirectional transfer direction (API_ID: 0x0013U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  transfer_direction: SPI transfer direction
                only one parameter can be selected which is shown as below:
      \arg        SPI_BIDIRECTIONAL_TRANSMIT: SPI work in transmit-only mode
      \arg        SPI_BIDIRECTIONAL_RECEIVE: SPI work in receive-only mode
    \param[out] none
    \retval     none
*/
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else if(NOT_SPI_TRANS_DIR(transfer_direction)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_BIDIRECTIONAL_TRANSMIT == transfer_direction) {
            /* set the transmit only mode */
            SPI_CTL0(spi_periph) |= (uint32_t)SPI_BIDIRECTIONAL_TRANSMIT;
        } else {
            /* set the receive only mode */
            SPI_CTL0(spi_periph) &= SPI_BIDIRECTIONAL_RECEIVE;
        }
    }
}

/*!
    \brief      clear SPI/I2S format error flag status (API_ID: 0x0014U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  flag: SPI/I2S frame format error flag
      \arg        SPI_FLAG_FERR: only for SPI work in TI mode
      \arg        I2S_FLAG_FERR: for I2S
    \param[out] none
    \retval     none
*/
void spi_i2s_format_error_clear(uint32_t spi_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else if(NOT_SPI_FRAME_FORMAT_ERROR_FLAG(flag)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0014U), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_STAT(spi_periph) &= (uint32_t)(~flag);
    }
}

/*!
    \brief      set the data size for transfer (API_ID: 0x0015U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  data_size: data size
      \arg        SPI_DATA_SIZEn (n=1...32)
    \param[out] none
    \retval     none
*/
void spi_i2s_data_size(uint32_t spi_periph, uint8_t data_size)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_SPI_DATA_SIZE(data_size)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

