sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.c
        reg = SPI_CTL1(spi_periph);
        reg &= SPI_DZ_INIT_MASK;
        reg |= (((uint32_t)data_size) << 8U);

        SPI_CTL1(spi_periph) = reg;
    }
}

/*!
    \brief      FIFO loopback mode enable (API_ID: 0x0016U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_i2s_fifo_loopback_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= SPI_CTL1_FIFOLBEN;
    }
}

/*!
    \brief      FIFO loopback mode disable (API_ID: 0x0017U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_i2s_fifo_loopback_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_FIFOLBEN);
    }
}

/*!
    \brief      RXFIFO current word number (API_ID: 0x0018U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     32-bit data
*/
uint32_t spi_i2s_read_rxlvl_words(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg = 0U;
        reg |= SPI_STAT(spi_periph);
        reg &= SPI_RXLVL_MASK;
        reg = reg >> 9;

        reval = ((uint32_t) reg);
    }
    return reval;
}

/*!
    \brief      TXFIFO current word number (API_ID: 0x0019U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     32-bit data
*/
uint32_t spi_i2s_read_txlvl_words(uint32_t spi_periph)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg = 0U;
        reg |= SPI_STAT(spi_periph);
        reg &= SPI_TXLVL_MASK;
        reg = reg >> 14;

        reval = ((uint32_t) reg);
    }
    return reval;
}

/*!
    \brief      set SPI CRC polynomial (API_ID: 0x001AU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  crc_poly: CRC polynomial value
    \param[out] none
    \retval     none
*/
void spi_crc_polynomial_set(uint32_t spi_periph, uint32_t crc_poly)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else
#endif
    {
        /* enable SPI CRC */
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_CRCEN;

        /* set SPI CRC polynomial */
        SPI_CRCPOLY(spi_periph) = (uint32_t)crc_poly;
    }
}

/*!
    \brief      get SPI CRC polynomial (API_ID: 0x001BU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     CRC polynomial
*/
uint32_t spi_crc_polynomial_get(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)SPI_CRCPOLY(spi_periph));
    }
    return reval;
}

/*!
    \brief      turn on CRC function (API_ID: 0x001CU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_crc_on(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_CRCEN;
    }
}

/*!
    \brief      turn off CRC function (API_ID: 0x001DU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_crc_off(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_CRCEN);
    }
}

/*!
    \brief      SPI next data is CRC value (API_ID: 0x001EU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_crc_next(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_CRCNT;
    }
}

/*!
    \brief      get SPI CRC send value (API_ID: 0x001FU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     CRC value
*/
uint32_t spi_tx_crc_get(uint32_t spi_periph)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)(SPI_TCRC(spi_periph)));
    }
    return reval;
}

/*!
    \brief      enable SPI TI mode (API_ID: 0x0020U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_ti_mode_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_TMOD;
    }
}

/*!
    \brief      disable SPI TI mode (API_ID: 0x0021U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_ti_mode_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_TMOD);
    }
}

/*!
    \brief      enable SPI NSS pulse mode (API_ID: 0x0022U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nssp_mode_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_NSSP;
    }
}

/*!
    \brief      disable SPI NSS pulse mode (API_ID: 0x0023U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nssp_mode_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_NSSP);
    }
}

/*!
    \brief      enable quad wire SPI (API_ID: 0x0024U)
    \param[in]  spi_periph: SPIx(x=0/2)
    \param[out] none
    \retval     none
*/
void spi_quad_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QUAD_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) |= (uint32_t)SPI_QCTL_QMOD;
    }
}

/*!
    \brief      disable quad wire SPI (API_ID: 0x0025U)
    \param[in]  spi_periph: SPIx(x=0/2)
    \param[out] none
    \retval     none
*/
void spi_quad_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QUAD_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) &= (uint32_t)(~SPI_QCTL_QMOD);
    }
}

/*!
    \brief      enable quad wire SPI write (API_ID: 0x0026U)
    \param[in]  spi_periph: SPIx(x=0/2)
    \param[out] none
    \retval     none
*/
void spi_quad_write_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QUAD_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) &= (uint32_t)(~SPI_QCTL_QRD);
    }
}

/*!
    \brief      enable quad wire SPI read (API_ID: 0x0027U)
    \param[in]  spi_periph: SPIx(x=0/2)
    \param[out] none
    \retval     none
*/
void spi_quad_read_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QUAD_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) |= (uint32_t)SPI_QCTL_QRD;
    }
}

/*!
    \brief      get SPI and I2S flag status (API_ID: 0x0028U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  flag: SPI/I2S flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_FLAG_RFDR:   reception fifo data ready flag
      \arg        SPI_FLAG_TFA:    transmission fifo available flag
      \arg        SPI_FLAG_TXURERR: underrun error flag
      \arg        SPI_FLAG_CONFERR: mode config error flag
      \arg        SPI_FLAG_RXORERR: receive overrun error flag
      \arg        SPI_FLAG_TRANS:  transmit on-going flag
      \arg        SPI_FLAG_FERR:   format error flag
      \arg        SPI_FLAG_TOF:    timeout flag
      \arg        I2S_FLAG_RFDR: reception fifo data ready flag
      \arg        I2S_FLAG_TFA: transmission fifo available flag
      \arg        I2S_FLAG_CH: channel side flag
      \arg        I2S_FLAG_TXURERR: underrun error flag
      \arg        I2S_FLAG_RXORERR: overrun error flag
      \arg        I2S_FLAG_TRANS: transmit on-going flag
      \arg        I2S_FLAG_FERR: format error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus spi_i2s_flag_get(uint32_t spi_periph, uint32_t flag)
{
    FlagStatus reval = RESET ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_SPI_I2S_FLAG_STATUS(flag)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(0U != (SPI_STAT(spi_periph) & flag)) {
            reval = SET;
        }
    }
    return reval;
}
/*!
    \brief      enable SPI and I2S interrupt (API_ID: 0x0029U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  interrupt: SPI/I2S interrupt
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_TFA: transmit buffer empty interrupt
      \arg        SPI_I2S_INT_RFDR: receive buffer not empty interrupt
      \arg        SPI_I2S_INT_ERR: configuration error,reception overrun error,
                                   transmission underrun error and format error interrupt
      \arg        SPI_INT_TO: timeout interrupt
    \param[out] none
    \retval     none
*/
void spi_i2s_interrupt_enable(uint32_t spi_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= interrupt;
    }
}

/*!
    \brief      disable SPI and I2S interrupt (API_ID: 0x002AU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  interrupt: SPI/I2S interrupt
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_TFA: transmit buffer empty interrupt
      \arg        SPI_I2S_INT_RFDR: receive buffer not empty interrupt
      \arg        SPI_I2S_INT_ERR: configuration error,reception overrun error,
                                   transmission underrun error and format error interrupt
      \arg        SPI_INT_TO: timeout interrupt
    \param[out] none
    \retval     none
*/
void spi_i2s_interrupt_disable(uint32_t spi_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= ~interrupt;
    }
}

/*!
    \brief      get SPI and I2S interrupt flag status (API_ID: 0x002BU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  interrupt: SPI/I2S interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_FLAG_TFA: transmit buffer empty interrupt flag
      \arg        SPI_I2S_INT_FLAG_RFDR: receive buffer not empty interrupt flag
      \arg        SPI_I2S_INT_FLAG_RXORERR: overrun interrupt flag
      \arg        SPI_I2S_INT_FLAG_TXURERR: underrun error interrupt flag
      \arg        SPI_INT_FLAG_TOF: timeout interrupt flag
      \arg        SPI_INT_FLAG_CONFERR: config error interrupt flag
      \arg        SPI_I2S_INT_FLAG_FERR: format error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus spi_i2s_interrupt_flag_get(uint32_t spi_periph, uint8_t interrupt)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT_FLAG_STATUS(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg1 = SPI_STAT(spi_periph);
        uint32_t reg2 = SPI_CTL1(spi_periph);

        switch(interrupt) {
            /* SPI/I2S transmit buffer empty interrupt */
            case SPI_I2S_INT_FLAG_TFA:
            reg1 = reg1 & SPI_STAT_TFA;
            reg2 = reg2 & SPI_CTL1_TFAIE;
            break;
            /* SPI/I2S receive buffer not empty interrupt */
            case SPI_I2S_INT_FLAG_RFDR:
            reg1 = reg1 & SPI_STAT_RFDR;
            reg2 = reg2 & SPI_CTL1_RFDRIE;
            break;
            /* SPI/I2S overrun interrupt */
            case SPI_I2S_INT_FLAG_RXORERR:
            reg1 = reg1 & SPI_STAT_RXORERR;
            reg2 = reg2 & SPI_CTL1_ERRIE;
            break;
            /* SPI/I2S underrun error interrupt */
            case SPI_I2S_INT_FLAG_TXURERR:
            reg1 = reg1 & SPI_STAT_TXURERR;
            reg2 = reg2 & SPI_CTL1_ERRIE;
            break;
            /* SPI timeout interrupt */
            case SPI_INT_FLAG_TOF:
            reg1 = reg1 & SPI_STAT_TOF;
            reg2 = reg2 & SPI_CTL1_TOIE;
            break;
            /* SPI config error interrupt */
            case SPI_INT_FLAG_CONFERR:
            reg1 = reg1 & SPI_STAT_CONFERR;
            reg2 = reg2 & SPI_CTL1_ERRIE;
            break;
            /* SPI/I2S format error interrupt */
            case SPI_I2S_INT_FLAG_FERR:
            reg1 = reg1 & SPI_STAT_FERR;
            reg2 = reg2 & SPI_CTL1_ERRIE;
            break;
            default:
            break;
        }
        /*get SPI/I2S interrupt flag status */
        if((0U != reg1) && (0U != reg2)) {
            reval = SET;
        }
    }
    return reval;
}

/*!
    \brief      SPI configure the SPI_MREQCFG direction is output (API_ID: 0x002CU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_output(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) |= SPI_MREQCFG_MREQDIR;
    }
}

/*!
    \brief      SPI configure the SPI_MREQCFG direction is input (API_ID: 0x002DU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_input(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) &= (~SPI_MREQCFG_MREQDIR);
    }
}

/*!
    \brief      SPI host request input is the SPI_MREQCFG pin (API_ID: 0x002EU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hrsel_pin(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) &= (~SPI_MREQCFG_MREQSEL);
    }
}

/*!
    \brief      host request input is the input trigger (API_ID: 0x002FU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hrsel_trigger(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) |= SPI_MREQCFG_MREQSEL;
    }
}

/*!
    \brief      SPI configures the polarity of the host request pin or trigger as active high (API_ID: 0x0030U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_high(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) &= (~SPI_MREQCFG_MREQPL);
    }
}

/*!
    \brief      SPI configures the polarity of the host request pin or trigger as active low (API_ID: 0x0031U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_low(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) |= SPI_MREQCFG_MREQPL;
    }
}

/*!
    \brief      SPI master request enable (API_ID: 0x0032U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) |= SPI_MREQCFG_MREQEN;
    }
}

/*!
    \brief      SPI master request disable (API_ID: 0x0033U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_hr_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif
    {
        SPI_MREQCFG(spi_periph) &= (~SPI_MREQCFG_MREQEN);
    }
}

/*!
    \brief      Configure NSS polarity as active high (API_ID: 0x0034U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_polarity_high(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= (uint32_t)SPI_CTL1_NSSPOL;
    }
}

/*!
    \brief      Configure NSS polarity as active low (API_ID: 0x0035U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_nss_polarity_low(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_NSSPOL);
    }
}

/*!
    \brief      Configure minimum delay from NSS inactive to NSS active (API_ID: 0x0036U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  delay: 0-0xFF, delay range is 1*SCK to 256*SCK
    \param[out] none
    \retval     none
*/
void spi_nssnss_delay(uint32_t spi_periph, uint8_t delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CKCFG0(spi_periph) &= (uint32_t)(~SPI_CKCFG0_NSSNSS);
        SPI_CKCFG0(spi_periph) |= ((uint32_t)delay << 16U);
    }
}

/*!
    \brief      Configure minimum delay from SCK inactive to NSS inactive (API_ID: 0x0037U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  delay: 0-0xFF, delay range is 1*SCK to 256*SCK
    \param[out] none
    \retval     none
*/
void spi_scknss_delay(uint32_t spi_periph, uint8_t delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CKCFG0(spi_periph) &= (uint32_t)(~SPI_CKCFG0_SCKNSS);
        SPI_CKCFG0(spi_periph) |= ((uint32_t)delay << 8U);
    }
}

/*!
    \brief      Configure minimum delay from NSS active to SCK active (API_ID: 0x0038U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  delay: 0-0xFF, delay range is 1*SCK to 256*SCK
    \param[out] none
    \retval     none
*/
void spi_nsssck_delay(uint32_t spi_periph, uint8_t delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CKCFG0(spi_periph) &= (uint32_t)(~SPI_CKCFG0_NSSSCK);
        SPI_CKCFG0(spi_periph) |= ((uint32_t)delay << 0U);
    }
}

/*!
    \brief      Enable SPI sampling delay (API_ID: 0x0039U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_sample_delay_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CKCFG1(spi_periph) |= SPI_CKCFG1_SAMPDLYEN;
    }
}

/*!
    \brief      Disable SPI sampling delay (API_ID: 0x003AU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_sample_delay_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CKCFG1(spi_periph) &= (uint32_t)(~SPI_CKCFG1_SAMPDLYEN);
    }
}

/*!
    \brief      Configure SPI sampling delay compensation time (API_ID: 0x003BU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  delay: 0-0x0FFF, delay range is 1*CK_SPI to 4096*SCK_SPI
    \param[out] none
    \retval     none
*/
void spi_sample_delay_config(uint32_t spi_periph, uint16_t delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if (NOT_SPI_SAMPLE_DELAY_NUM(delay)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_CKCFG1(spi_periph) &= (uint32_t)(~SPI_CKCFG1_SAMPDLY);
        SPI_CKCFG1(spi_periph) |= ((uint32_t)delay << 0U);
    }
}

/*!
    \brief      Enable SPI bus idle timeout (API_ID: 0x003CU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_idle_timeout_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= SPI_CTL1_TOEN;
    }
}

/*!
    \brief      Disable SPI bus idle timeout (API_ID: 0x003DU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_idle_timeout_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_TOEN);
    }
}

