sorosaulong-ux/gd32-test-project/Library/gd32a7xx_spi.c
/*!
    \brief      Configure SPI bus idle timeout threshold (API_ID: 0x003EU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  threshold: 0-0xFF, timeout threshold value range is 1*SCK to 256*SCK
    \param[out] none
    \retval     none
*/
void spi_idle_threshold_config(uint32_t spi_periph, uint8_t threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_TOCFG);
        SPI_CTL1(spi_periph) |= ((uint32_t)threshold << 24U);
    }
}

/*!
    \brief      Clear SPI idle timeout flag (API_ID: 0x003FU)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_timeout_flag_clear(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else
#endif
    {
        SPI_STAT(spi_periph) &= (uint32_t)(~SPI_STAT_TOF);
    }
}

/*!
    \brief      Clear SPI idle timeout interrupt flag (API_ID: 0x0040U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_timeout_interrupt_flag_clear(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        SPI_STAT(spi_periph) &= (uint32_t)(~SPI_STAT_TOF);
    }
}

/*!
    \brief      Enable SPI hardware single-frame mode (API_ID: 0x0041U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_single_frame_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) |= SPI_CTL1_SINGMOD;
    }
}

/*!
    \brief      Disable SPI hardware single-frame mode (API_ID: 0x0042U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_single_frame_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL1(spi_periph) &= (uint32_t)(~SPI_CTL1_SINGMOD);
    }
}

/*!
    \brief      Enable SPI hardware continuous-frame mode (API_ID: 0x0043U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_continuous_frame_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CCTL(spi_periph) |= SPI_CCTL_HCEN;
    }
}

/*!
    \brief      Disable SPI hardware continuous-frame mode (API_ID: 0x0044U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[out] none
    \retval     none
*/
void spi_continuous_frame_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CCTL(spi_periph) &= (uint32_t)(~SPI_CCTL_HCEN);
    }
}

/*!
    \brief      Configure SPI hardware continuous-frame length (API_ID: 0x0045U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  length: 0-0xFFFF, frame length range is 1 frame to 65536 frames
    \param[out] none
    \retval     none
*/
void spi_continuous_frame_length_config(uint32_t spi_periph, uint16_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CCTL(spi_periph) &= (uint32_t)(~SPI_CCTL_FRAMLEN);
        SPI_CCTL(spi_periph) |= ((uint32_t)length << 0U);
    }
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      Configure multiple NSS pins polarity as active high (API_ID: 0x0046U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  nss_pin: NSS pin
                one or more parameters can be selected which are shown as below:
      \arg        SPI_NSS_PIN_0: NSS pin 0
      \arg        SPI_NSS_PIN_1: NSS pin 1
      \arg        SPI_NSS_PIN_2: NSS pin 2
      \arg        SPI_NSS_PIN_3: NSS pin 3
      \arg        SPI_NSS_PIN_4: NSS pin 4
      \arg        SPI_NSS_PIN_5: NSS pin 5
      \arg        SPI_NSS_PIN_6: NSS pin 6
      \arg        SPI_NSS_PIN_7: NSS pin 7
    \param[out] none
    \retval     none
*/
void spi_multi_nss_polarity_high(uint32_t spi_periph, uint32_t nss_pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0046U), ERR_PERIPH);
    } else if (NOT_SPI_NSS_PIN(nss_pin)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0046U), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_POLCTL(spi_periph) |= (uint32_t)SPI_POLCTL_NSSPOLMOD;
        SPI_POLCTL(spi_periph) |= (uint32_t)nss_pin;
    }
}

/*!
    \brief      Configure multiple NSS pins polarity as active low (API_ID: 0x0047U)
    \param[in]  spi_periph: SPIx(x=0...7)
    \param[in]  nss_pin: NSS pin mask
                one or more parameters can be selected which are shown as below:
      \arg        SPI_NSS_PIN_0: NSS pin 0
      \arg        SPI_NSS_PIN_1: NSS pin 1
      \arg        SPI_NSS_PIN_2: NSS pin 2
      \arg        SPI_NSS_PIN_3: NSS pin 3
      \arg        SPI_NSS_PIN_4: NSS pin 4
      \arg        SPI_NSS_PIN_5: NSS pin 5
      \arg        SPI_NSS_PIN_6: NSS pin 6
      \arg        SPI_NSS_PIN_7: NSS pin 7
    \param[out] none
    \retval     none
*/
void spi_multi_nss_polarity_low(uint32_t spi_periph, uint32_t nss_pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    if (NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0047U), ERR_PERIPH);
    } else if (NOT_SPI_NSS_PIN(nss_pin)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0047U), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_POLCTL(spi_periph) |= (uint32_t)SPI_POLCTL_NSSPOLMOD;
        SPI_POLCTL(spi_periph) &= (uint32_t)(~nss_pin);
    }
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
